       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
      ********************************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR - MIGUEL DOS SANTOS RIBEIRO MISANRI
      * MOSTRAR A STRING HELLO ALURA
      * DATA 04/06/2020
      ********************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO ALURA'.
           STOP RUN.
