       IDENTIFICATION DIVISION.

       PROGRAM-ID. PROGCOB03.
      ******************************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR - MIGUEL DOS SAMTOS RIBEIRO MISANRI
      * OBJETIVO - IMPRIMIR A DATA DO SISTEMA
      * UTILIZAR AS VARIAVEIS COM NIVEL 01..02..(ESTRUTURADA)
      *DATA - 05/06/2020
      ******************************************
       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WRK-DATA.
              02 WRK-ANO PIC 9(04) VALUES ZEROS.
              02 WRK-MES PIC 9(02) VALUES ZEROS.
              02 WRK-DIA PIC 9(02) VALUES ZEROS.
       PROCEDURE DIVISION.
              ACCEPT WRK-DATA FROM DATE YYYYMMDD.
              DISPLAY 'DATA: ' WRK-DIA '/' WRK-MES '/' WRK-ANO.
              STOP RUN.
